Tekla.Structures.Dialog.ApplicationWindowBase
The ApplicationWindowBase class is the base class for all Tekla Structures WPF dialogs.
The class provides localization, unit conversion and data storage
(temporary and file-based) among other things.

Tekla.Structures.Dialog.ApplicationWindowBase.#ctor
The default constructor that does not need parameters.
Initializes the window, property binding can be initialized with InitializeDataStorage()-method.

Tekla.Structures.Dialog.ApplicationWindowBase.InitializeDataStorage(System.Object)
Initializes the datastorage and registers property bindings for defined viewmodel.
ViewModel: The view model with StructuresDialog attribute definitions.

Tekla.Structures.Dialog.ApplicationWindowBase.DoLoad
It raises the Load event.

Tekla.Structures.Dialog.ApplicationWindowBase.DoInitializeWindow
Prepares the data storage for the dialog and scans through the fields.

Tekla.Structures.Dialog.ApplicationWindowBase.Apply
The method to call when the Apply button is clicked. Stores the current dialog
values to the dialog data storage.